WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
/*
 * flash_storage.c — Preset-based parameter persistence for DSPi
 *
 * Flash Layout (from end of flash, working backwards):
 *
 *   Sector 0  (-48 KB):  Preset Directory  (metadata, slot names, startup config)
 *   Sector 1  (-44 KB):  Preset Slot 0     (full DSP state snapshot)
 *   Sector 2  (-40 KB):  Preset Slot 1
 *   ...
 *   Sector 10 ( -8 KB):  Preset Slot 9
 *   Sector 11 ( -4 KB):  Legacy sector     (old single-preset format, kept for
 *                                            backward compat / migration)
 *
 * Each sector is 4 KB (FLASH_SECTOR_SIZE).  A preset slot stores the complete
 * user-configurable DSP state: EQ bands, preamp, delays, loudness, crossfeed,
 * matrix mixer, channel gains/mutes, and optionally pin assignments.
 *
 * The directory sector holds a 10-bit occupancy bitmask, 10 x 32-byte slot
 * names, startup configuration (which slot to load on boot), and the index
 * of the last-active slot.
 *
 * On boot, preset_boot_load() reads the directory and loads the appropriate
 * slot based on the startup policy.  If no directory exists (first boot after
 * firmware upgrade), it attempts to migrate the legacy single-sector data
 * into slot 0.
 */

#include "flash_storage.h"
#include "config.h"
#include "audio_input.h"
#if !defined(STM32H723xx)
#include "spdif_input.h"
#endif
#include "dsp_pipeline.h"
#include "flash_clkdiv.h"
#include "usb_audio.h"
#include "crossfeed.h"
#if !defined(STM32H723xx)
#include "pdm_generator.h"
#include "usb_feedback_controller.h"
#endif
#include "leveller.h"
#include "notify.h"

#if defined(STM32H723xx)
/* STM32 platform: no pico-sdk, no Core 1, no PDM. flash_clkdiv.h above
 * already supplied FLASH_SECTOR_SIZE / FLASH_PAGE_SIZE / XIP_BASE /
 * PICO_FLASH_SIZE_BYTES / dspi_flash_range_*. Stub the multicore +
 * fb_ctrl + pdm calls so the imported file compiles unchanged.
 * Core1Mode + feedback globals come from config.h / audio_state.c. */
#include "platform_compat.h"
#include "stm32h7xx_hal.h"     /* for __SEV / CMSIS intrinsics */
/* HAL_FLASH (transitively included via platform_compat / stm32h7xx_hal.h)
 * defines FLASH_SECTOR_SIZE = 128 KB for the H7 internal flash. We need
 * the W25Q64's 4 KB sectors here — re-undef after the HAL include so
 * static buffers like write_buf[FLASH_SECTOR_SIZE] size correctly. */
#undef  FLASH_SECTOR_SIZE
#undef  FLASH_PAGE_SIZE
#define FLASH_SECTOR_SIZE 4096U
#define FLASH_PAGE_SIZE   256U
/* Disable IRQ-blanking around flash writes on STM32. The RP path uses
 * save_and_disable_interrupts() for XIP-cache safety: while internal
 * flash is being erased, instruction fetches from XIP would wedge the
 * core. We don't have that issue — the W25Q is on SPI3, code runs from
 * internal flash + cache, the two never interact. Keeping IRQs enabled
 * during the ~45 ms sector erase lets the audio path keep streaming
 * (mute is engaged via preset_loading anyway) and lets USB respond to
 * NAKs without timing out. */
#undef  save_and_disable_interrupts
#undef  restore_interrupts
#define save_and_disable_interrupts() (0)
#define restore_interrupts(flags)     ((void)(flags))
#define multicore_lockout_victim_is_initialized(c) (false)
#define multicore_lockout_start_blocking()         do {} while (0)
#define multicore_lockout_end_blocking()           do {} while (0)
#define __get_current_exception()                  ((uint32_t)__get_IPSR())
#define __sev()                                    __SEV()
#define fb_ctrl_reset(ctrl, val)                   do {} while (0)
#define pdm_set_enabled(en)                        do {} while (0)
typedef int usb_feedback_ctrl_t;
static usb_feedback_ctrl_t fb_ctrl;
extern Core1Mode core1_mode;
extern Core1Mode derive_core1_mode(void);
#else
#include "hardware/flash.h"
#include "hardware/sync.h"
#include "pico/stdlib.h"
#include "pico/multicore.h"
#endif

#include <string.h>
#include <math.h>    // powf(), isfinite() for master volume (db_to_linear() clamps at -60 dB)

// ============================================================================
// FLASH GEOMETRY
// ============================================================================

// Total reservation: 12 sectors (48 KB) at the end of flash.
// Sector 0 = directory, sectors 1-10 = preset slots, sector 11 = legacy.
#define PRESET_TOTAL_SECTORS    12
#define PRESET_BASE_OFFSET      (PICO_FLASH_SIZE_BYTES - (PRESET_TOTAL_SECTORS * FLASH_SECTOR_SIZE))

// Individual sector offsets (byte offset from start of flash)
#define DIR_SECTOR_OFFSET       (PRESET_BASE_OFFSET)
#define SLOT_SECTOR_OFFSET(n)   (PRESET_BASE_OFFSET + ((1 + (n)) * FLASH_SECTOR_SIZE))
#define LEGACY_SECTOR_OFFSET    (PICO_FLASH_SIZE_BYTES - FLASH_SECTOR_SIZE)

// XIP read pointers (memory-mapped flash)
#define DIR_ADDR                ((const PresetDirectory *)(XIP_BASE + DIR_SECTOR_OFFSET))
#define SLOT_ADDR(n)            ((const PresetSlot *)(XIP_BASE + SLOT_SECTOR_OFFSET(n)))
#define LEGACY_ADDR             ((const LegacyFlashStorage *)(XIP_BASE + LEGACY_SECTOR_OFFSET))

// Magic numbers — each distinct so we can tell sector types apart
#define DIR_MAGIC               0x44535032  // "DSP2"
#define SLOT_MAGIC              0x44535033  // "DSP3"
#define LEGACY_MAGIC            0x44535031  // "DSP1" (original format)

// Current data version for preset slot contents
#define SLOT_DATA_VERSION       13   // V13: input source selection

// ============================================================================
// ON-FLASH STRUCTURES
// ============================================================================

// Storage structure for matrix crosspoint (packed for flash)
typedef struct __attribute__((packed)) {
    uint8_t enabled;
    uint8_t phase_invert;
    uint8_t reserved[2];
    float gain_db;
} FlashMatrixCrosspoint;

// Storage structure for output channel (packed for flash)
typedef struct __attribute__((packed)) {
    uint8_t enabled;
    uint8_t mute;
    uint8_t reserved[2];
    float gain_db;
    float delay_ms;
} FlashOutputChannel;

