WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
// --- Preset Directory v1 (legacy — kept only for upgrade migration) ---
typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t version;                        // == 1
    uint16_t reserved;
    uint32_t crc32;

    uint8_t  startup_mode;
    uint8_t  default_slot;
    uint8_t  last_active_slot;
    uint8_t  include_pins;

    uint16_t slot_occupied;
    uint8_t  include_master_volume;
    uint8_t  padding[1];
    char     slot_names[PRESET_SLOTS][PRESET_NAME_LEN];
} PresetDirectory_v1;

// --- Preset Directory v2 (current, sector 0) ---
typedef struct __attribute__((packed)) {
    uint32_t magic;                          // DIR_MAGIC
    uint16_t version;                        // Directory format version (2)
    uint16_t reserved;
    uint32_t crc32;                          // CRC over everything after this 12-byte header

    // Startup configuration
    uint8_t  startup_mode;                   // PRESET_STARTUP_SPECIFIED or _LAST_ACTIVE
    uint8_t  default_slot;                   // Slot to load in SPECIFIED mode (0-9)
    uint8_t  last_active_slot;               // Last loaded/saved slot (always 0-9)
    uint8_t  include_pins;                   // Whether preset load restores pin config

    // Slot metadata
    uint16_t slot_occupied;                  // Bitmask: bit N = slot N has valid data
    uint8_t  master_volume_mode;             // MASTER_VOLUME_MODE_INDEPENDENT or _WITH_PRESET (was include_master_volume)
    uint8_t  spdif_rx_pin;                   // SPDIF RX GPIO pin, device-level (was padding[1])
    float    master_volume_db;               // Independent master volume (mode 0 at boot)
    char     slot_names[PRESET_SLOTS][PRESET_NAME_LEN];  // 32-byte NUL-terminated names
} PresetDirectory;

#define DIR_VERSION_CURRENT  2

// --- Preset Slot (sectors 1-10) ---
typedef struct __attribute__((packed)) {
    uint32_t magic;                          // SLOT_MAGIC
    uint16_t version;                        // Data format version (matches SLOT_DATA_VERSION)
    uint16_t slot_index;                     // Which slot this is (sanity check)
    uint32_t crc32;                          // CRC over data section

    // ====== DSP State (same fields as legacy FlashStorage, same order) ======
    EqParamPacket filter_recipes[NUM_CHANNELS][MAX_BANDS];
    float preamp_db;
    uint8_t bypass;
    uint8_t padding[3];
    float delays_ms[NUM_CHANNELS];
    // Legacy per-channel gain/mute (V2)
    float channel_gain_db[3];
    uint8_t channel_mute[3];
    uint8_t padding2;
    // Loudness (V3)
    uint8_t loudness_enabled;
    uint8_t padding3[3];
    float loudness_ref_spl;
    float loudness_intensity_pct;
    // Crossfeed (V4)
    uint8_t crossfeed_enabled;
    uint8_t crossfeed_preset;
    uint8_t crossfeed_itd_enabled;
    uint8_t padding4;
    float crossfeed_custom_fc;
    float crossfeed_custom_feed_db;
    // Matrix mixer (V5)
    FlashMatrixCrosspoint matrix_crosspoints[NUM_INPUT_CHANNELS][NUM_OUTPUT_CHANNELS];
    FlashOutputChannel matrix_outputs[NUM_OUTPUT_CHANNELS];
    // Pin configuration (V6) — always stored, conditionally loaded
    uint8_t output_pins[NUM_PIN_OUTPUTS];
    uint8_t pin_padding[8 - NUM_PIN_OUTPUTS];
    // Channel names (V8)
    char channel_names[NUM_CHANNELS][PRESET_NAME_LEN];
    // I2S output configuration (V9)
    uint8_t output_types[4];     // Per-slot type: 0=S/PDIF, 1=I2S (padded to 4)
    uint8_t i2s_bck_pin;         // BCK GPIO; LRCLK = BCK + 1
    uint8_t i2s_mck_pin;         // MCK GPIO
    uint8_t i2s_mck_enabled;     // MCK on/off (0 or 1)
    uint8_t i2s_mck_multiplier;  // MCK = multiplier × Fs (128 or 256)
    // Volume Leveller (V10)
    uint8_t leveller_enabled;
    uint8_t leveller_speed;
    uint8_t leveller_lookahead;
    uint8_t leveller_padding;
    float   leveller_amount;
    float   leveller_max_gain_db;
    float   leveller_gate_threshold_db;
    // Per-channel preamp + Master volume (V12)
    float   preamp_db_per_ch[NUM_INPUT_CHANNELS];  // Per-input-channel preamp (dB)
    float   master_volume_db;                       // Device master volume (-128 mute, -127..0 dB)
    // Input source selection (V13) + SPDIF RX pin
    //
    // spdif_rx_pin claims one of V13's three padding bytes without changing
    // the slot struct size, so existing V13 slots remain CRC-valid: their
    // padding bytes were zero-initialised by collect_live_state's memset
    // (line ~484), and apply_slot_to_live treats spdif_rx_pin == 0 as
    // invalid and falls through to the live default — same effect as if
    // the byte never existed. Forward saves write the live pin and the
    // CRC is recomputed at save time.
    uint8_t input_source;            // InputSource enum (0=USB, 1=SPDIF)
    uint8_t spdif_rx_pin;            // SPDIF RX GPIO (0 = absent → use default)
    uint8_t input_source_padding[2]; // Pad to 4-byte boundary
} PresetSlot;

// --- Legacy single-sector format (for migration) ---
typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t version;
    uint16_t reserved;
    uint32_t crc32;
    EqParamPacket filter_recipes[NUM_CHANNELS][MAX_BANDS];
    float preamp_db;
    uint8_t bypass;
    uint8_t padding[3];
    float delays_ms[NUM_CHANNELS];
    float channel_gain_db[3];
    uint8_t channel_mute[3];
    uint8_t padding2;
    uint8_t loudness_enabled;
    uint8_t padding3[3];
    float loudness_ref_spl;
    float loudness_intensity_pct;
    uint8_t crossfeed_enabled;
    uint8_t crossfeed_preset;
    uint8_t crossfeed_itd_enabled;
    uint8_t padding4;
    float crossfeed_custom_fc;
    float crossfeed_custom_feed_db;
    FlashMatrixCrosspoint matrix_crosspoints[NUM_INPUT_CHANNELS][NUM_OUTPUT_CHANNELS];
    FlashOutputChannel matrix_outputs[NUM_OUTPUT_CHANNELS];
    uint8_t output_pins[NUM_PIN_OUTPUTS];
    uint8_t pin_padding[8 - NUM_PIN_OUTPUTS];
} LegacyFlashStorage;

// ============================================================================
// EXTERNAL VARIABLES (defined in usb_audio.c / dsp_pipeline.c)
// ============================================================================

extern volatile float global_preamp_db[NUM_INPUT_CHANNELS];
extern volatile int32_t global_preamp_mul[NUM_INPUT_CHANNELS];
extern volatile float global_preamp_linear[NUM_INPUT_CHANNELS];
extern volatile float master_volume_db;
extern volatile float master_volume_linear;
extern volatile int32_t master_volume_q15;
// Defined in usb_audio.c — clamps, emits v1/v2 host notifications.
extern void update_master_volume(float db);
extern volatile float channel_gain_db[3];
extern volatile int32_t channel_gain_mul[3];
extern volatile bool channel_mute[3];
extern volatile bool loudness_enabled;
extern volatile float loudness_ref_spl;
extern volatile float loudness_intensity_pct;
extern volatile bool loudness_recompute_pending;
extern volatile CrossfeedConfig crossfeed_config;
extern volatile bool crossfeed_update_pending;
extern volatile LevellerConfig leveller_config;
extern volatile bool leveller_update_pending;
extern volatile bool leveller_reset_pending;
extern MatrixMixer matrix_mixer;
extern uint8_t output_pins[NUM_PIN_OUTPUTS];
extern char channel_names[NUM_CHANNELS][PRESET_NAME_LEN];
#if !defined(STM32H723xx)
extern volatile uint32_t feedback_10_14;
extern volatile uint32_t nominal_feedback_10_14;
extern usb_feedback_ctrl_t fb_ctrl;
#endif

// ============================================================================
// MODULE STATE
// ============================================================================

