WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
// Audio mute flag for glitch-free preset switching
volatile bool preset_loading = false;
volatile uint32_t preset_mute_counter = 0;

// Forward declaration — defined in LEGACY API section
static void apply_factory_defaults(void);

// RAM-cached copy of the directory — updated on every directory write and
// loaded once at boot.  Avoids repeated flash reads for queries.
static PresetDirectory dir_cache;
static bool dir_cache_valid = false;

// Flash mute hold time in samples (rate-aware).
//
// A fixed sample count shrinks in real time at higher rates (e.g. 96 kHz),
// which can be too short to cover post-flash pipeline refill and envelope
// transitions.  Keep the hold at roughly 10 ms across rates with a floor
// that preserves existing behavior at 48 kHz.
static inline uint32_t flash_mute_hold_samples(void) {
    uint64_t samples = ((uint64_t)audio_state.freq * 10u + 999u) / 1000u;
    if (samples < 512u) samples = 512u;
    return (uint32_t)samples;
}

// ============================================================================
// CRC32 (polynomial 0xEDB88320, same as legacy implementation)
// ============================================================================

static uint32_t crc32(const uint8_t *data, size_t len) {
    uint32_t crc = 0xFFFFFFFF;
    for (size_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int j = 0; j < 8; j++) {
            crc = (crc >> 1) ^ (0xEDB88320 & -(crc & 1));
        }
    }
    return ~crc;
}

// ============================================================================
// dB-TO-LINEAR CONVERSION (no powf dependency in flash context)
// ============================================================================

// Compute 10^(db/20).  An earlier 4-term Taylor approximation here was
// catastrophically wrong beyond ~±10 dB (at -60 dB it returned ~58 instead
// of 0.001, producing loud/distorted output after preset load with any
// deeply-negative gain — see preamp/gain/matrix paths below).  powf is fine:
// this function runs from flash after XIP is up, no RAM-residency constraint.
static float db_to_linear(float db) {
    if (db <= -120.0f) return 0.0f;
    if (db >=  +80.0f) db = 80.0f;
    return powf(10.0f, db / 20.0f);
}

// ============================================================================
// LOW-LEVEL FLASH HELPERS
// ============================================================================

// Erase one sector and write data into it.
// `offset` is the byte offset from the start of flash (not XIP address).
// `data` and `len` specify the payload; it is zero-padded up to page alignment.
static int flash_write_sector(uint32_t offset, const void *data, size_t len) {
    // Round up to page boundary
    size_t write_size = (len + FLASH_PAGE_SIZE - 1) & ~(FLASH_PAGE_SIZE - 1);

    // Use a page-aligned scratch buffer (static to avoid large stack allocs)
    static uint8_t __attribute__((aligned(256))) write_buf[FLASH_SECTOR_SIZE];
    memset(write_buf, 0xFF, sizeof(write_buf));
    memcpy(write_buf, data, len);

    // NOTE: earlier versions drained the SPDIF RX FIFO here via a
    // `while (spdif_input_poll() > 0)` loop.  That triggered full DSP
    // pipeline processing (including a Core 1 work dispatch + wait) inside
    // flash_write_sector, which introduced a crash path on preset_save
    // with SPDIF as the active input source.  The pre-blackout drain now
    // lives only in prepare_flash_write_operation()'s settle loop, which
    // runs once per top-level flash operation; multi-write operations
    // (preset_save = slot + dir) rely on the SPDIF RX library's own
    // overflow handling during the brief inter-write window.
    //
    // Park Core 1 in RAM before quiescing XIP for flash erase/program.
    // Guarded: (a) victim_is_initialized handles first-boot (Core 1 not
    // launched yet) and launch-to-init race; (b) __get_current_exception
    // skips lockout in IRQ context (USB vendor handler) where SDK lock
    // internals are unsafe — IRQ callers rely on copy_to_ram build for
    // XIP safety (see CMakeLists.txt:38).
    bool do_lockout = multicore_lockout_victim_is_initialized(1)
                      && (__get_current_exception() == 0);
    if (do_lockout) multicore_lockout_start_blocking();

    uint32_t flags = save_and_disable_interrupts();
    dspi_flash_range_erase(offset, FLASH_SECTOR_SIZE);
    dspi_flash_range_program(offset, write_buf, write_size);
    restore_interrupts(flags);

    if (do_lockout) multicore_lockout_end_blocking();

    // Re-seed USB feedback controller after ~45ms interrupt blackout
    // (see preset_bugfix.md for details)
    fb_ctrl_reset(&fb_ctrl, nominal_feedback_10_14 << 2);
    feedback_10_14 = nominal_feedback_10_14;

    // Re-arm mute to cover SPDIF consumer pool refill (~4-8ms)
    preset_mute_counter = flash_mute_hold_samples();
    preset_loading = true;

    // Verify magic survived the write
    const uint32_t *verify = (const uint32_t *)(XIP_BASE + offset);
    const uint32_t *expected = (const uint32_t *)data;
    if (*verify != *expected) {
        return -1;  // Write verification failed
    }
    return 0;
}

// ============================================================================
// DIRECTORY MANAGEMENT
// ============================================================================

// Load the directory from flash into the RAM cache.
// Returns true if a valid directory was found.  Transparently migrates a v1
// directory to v2 on first boot of new firmware, preserving slot names,
// startup config, and the old include_master_volume flag (which maps 1:1 to
// master_volume_mode).  The independent master_volume_db defaults to
// MASTER_VOL_MAX_DB so boot-time audible behavior is unchanged post-upgrade.
static int dir_flush(void);  // forward decl — migration calls it
static bool dir_load_cache(void) {
    const PresetDirectory *flash_dir = DIR_ADDR;
    if (flash_dir->magic != DIR_MAGIC) {
        dir_cache_valid = false;
        return false;
    }

    if (flash_dir->version == DIR_VERSION_CURRENT) {
        // Current format — CRC covers everything after the 12-byte header.
        const uint8_t *data_start = (const uint8_t *)&flash_dir->startup_mode;
        size_t data_len = sizeof(PresetDirectory) - offsetof(PresetDirectory, startup_mode);
        if (crc32(data_start, data_len) != flash_dir->crc32) {
            dir_cache_valid = false;
            return false;
        }
        memcpy(&dir_cache, flash_dir, sizeof(dir_cache));
        dir_cache_valid = true;
        return true;
    }

    if (flash_dir->version == 1) {
        // Legacy v1 format — read with the old struct, validate old CRC,
        // then migrate to v2 in memory and flush.
        const PresetDirectory_v1 *v1 = (const PresetDirectory_v1 *)flash_dir;
        const uint8_t *v1_data_start = (const uint8_t *)&v1->startup_mode;
        size_t v1_data_len = sizeof(PresetDirectory_v1) - offsetof(PresetDirectory_v1, startup_mode);
        if (crc32(v1_data_start, v1_data_len) != v1->crc32) {
            dir_cache_valid = false;
            return false;
        }
        memset(&dir_cache, 0, sizeof(dir_cache));
        dir_cache.startup_mode       = v1->startup_mode;
        dir_cache.default_slot       = v1->default_slot;
        dir_cache.last_active_slot   = v1->last_active_slot;
        dir_cache.include_pins       = v1->include_pins;
        dir_cache.slot_occupied      = v1->slot_occupied;
        dir_cache.master_volume_mode = v1->include_master_volume
                                         ? MASTER_VOLUME_MODE_WITH_PRESET
                                         : MASTER_VOLUME_MODE_INDEPENDENT;
        dir_cache.master_volume_db   = MASTER_VOL_DEFAULT_DB;
        memcpy(dir_cache.slot_names, v1->slot_names, sizeof(dir_cache.slot_names));
        dir_cache_valid = true;
        (void)dir_flush();  // persist as v2; if the flush fails, cache stays valid in RAM
        return true;
    }

    // Unknown future version — treat as invalid.
    dir_cache_valid = false;
    return false;
}

// Write the RAM-cached directory back to flash.
// Recomputes the CRC before writing.
static int dir_flush(void) {
    dir_cache.magic = DIR_MAGIC;
    dir_cache.version = DIR_VERSION_CURRENT;
    dir_cache.reserved = 0;
    // CRC covers everything after the 12-byte header (magic + version + reserved + crc32)
    const uint8_t *data_start = (const uint8_t *)&dir_cache.startup_mode;
    size_t data_len = sizeof(PresetDirectory) - offsetof(PresetDirectory, startup_mode);
    dir_cache.crc32 = crc32(data_start, data_len);

    if (flash_write_sector(DIR_SECTOR_OFFSET, &dir_cache, sizeof(dir_cache)) != 0) {
        return -1;
    }
    return 0;
}

// Ensure the directory cache is populated.  If no directory exists on flash,
// initialize a fresh one with factory-default settings.
static void dir_ensure(void) {
    if (dir_cache_valid) return;
    if (dir_load_cache()) return;

