WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
    // No valid directory — create a fresh one
    memset(&dir_cache, 0, sizeof(dir_cache));
    dir_cache.startup_mode = PRESET_STARTUP_SPECIFIED;
    dir_cache.default_slot = 0;
    dir_cache.last_active_slot = 0;     // Default to slot 0
    dir_cache.include_pins = 1;              // Include pins in preset load by default
    dir_cache.master_volume_mode = MASTER_VOLUME_MODE_INDEPENDENT;
    dir_cache.master_volume_db   = MASTER_VOL_DEFAULT_DB;
    dir_cache.spdif_rx_pin = PICO_SPDIF_RX_PIN_DEFAULT;
    dir_cache.slot_occupied = 0;             // All slots empty
    // Slot 0 gets a default name; others are empty (already zeroed by memset)
    strncpy(dir_cache.slot_names[0], "Default", PRESET_NAME_LEN - 1);
    dir_cache_valid = true;
    // Don't flush yet — will be flushed on first preset save
}

// ============================================================================
// COLLECT / APPLY DSP STATE
// ============================================================================

// Snapshot the current live DSP state into a PresetSlot structure.
static void collect_live_state(PresetSlot *slot, uint8_t slot_index) {
    memset(slot, 0, sizeof(*slot));

    slot->magic = SLOT_MAGIC;
    slot->version = SLOT_DATA_VERSION;
    slot->slot_index = slot_index;

    // EQ
    memcpy(slot->filter_recipes, (void *)filter_recipes, sizeof(slot->filter_recipes));

    // Preamp — legacy field stores channel 0 for backward compat
    slot->preamp_db = global_preamp_db[0];

    // Bypass
    slot->bypass = bypass_master_eq ? 1 : 0;

    // Delays
    memcpy(slot->delays_ms, (void *)channel_delays_ms, sizeof(slot->delays_ms));

    // Legacy per-channel gain/mute
    memcpy(slot->channel_gain_db, (void *)channel_gain_db, sizeof(slot->channel_gain_db));
    for (int i = 0; i < 3; i++)
        slot->channel_mute[i] = channel_mute[i] ? 1 : 0;

    // Loudness
    slot->loudness_enabled = loudness_enabled ? 1 : 0;
    slot->loudness_ref_spl = loudness_ref_spl;
    slot->loudness_intensity_pct = loudness_intensity_pct;

    // Crossfeed
    slot->crossfeed_enabled = crossfeed_config.enabled ? 1 : 0;
    slot->crossfeed_preset = crossfeed_config.preset;
    slot->crossfeed_itd_enabled = crossfeed_config.itd_enabled ? 1 : 0;
    slot->crossfeed_custom_fc = crossfeed_config.custom_fc;
    slot->crossfeed_custom_feed_db = crossfeed_config.custom_feed_db;

    // Matrix mixer
    for (int in = 0; in < NUM_INPUT_CHANNELS; in++) {
        for (int out = 0; out < NUM_OUTPUT_CHANNELS; out++) {
            slot->matrix_crosspoints[in][out].enabled = matrix_mixer.crosspoints[in][out].enabled;
            slot->matrix_crosspoints[in][out].phase_invert = matrix_mixer.crosspoints[in][out].phase_invert;
            slot->matrix_crosspoints[in][out].gain_db = matrix_mixer.crosspoints[in][out].gain_db;
        }
    }
    for (int out = 0; out < NUM_OUTPUT_CHANNELS; out++) {
        slot->matrix_outputs[out].enabled = matrix_mixer.outputs[out].enabled;
        slot->matrix_outputs[out].mute = matrix_mixer.outputs[out].mute;
        slot->matrix_outputs[out].gain_db = matrix_mixer.outputs[out].gain_db;
        slot->matrix_outputs[out].delay_ms = matrix_mixer.outputs[out].delay_ms;
    }

    // Pin configuration (always stored, conditionally loaded)
    memcpy(slot->output_pins, output_pins, sizeof(slot->output_pins));

    // SPDIF RX pin: stored alongside output_pins, loaded only when
    // include_pins is true (matches output_pins discipline).
    slot->spdif_rx_pin = spdif_rx_pin;

    // Channel names
    memcpy(slot->channel_names, channel_names, sizeof(slot->channel_names));

    // I2S configuration (V9)
    extern uint8_t output_types[];
    extern uint8_t i2s_bck_pin;
    extern uint8_t i2s_mck_pin;
    extern bool    i2s_mck_enabled;
    extern uint16_t i2s_mck_multiplier;
    memcpy(slot->output_types, output_types, NUM_SPDIF_INSTANCES);
    // Zero-pad remaining entries (RP2040 has 2 slots, array is 4)
    for (int i = NUM_SPDIF_INSTANCES; i < 4; i++) slot->output_types[i] = 0;
    slot->i2s_bck_pin = i2s_bck_pin;
    slot->i2s_mck_pin = i2s_mck_pin;
    slot->i2s_mck_enabled = i2s_mck_enabled ? 1 : 0;
    slot->i2s_mck_multiplier = (i2s_mck_multiplier == 256) ? 1 : 0;  // 0=128x, 1=256x

    // Volume Leveller (V10)
    slot->leveller_enabled = leveller_config.enabled ? 1 : 0;
    slot->leveller_speed = leveller_config.speed;
    slot->leveller_lookahead = leveller_config.lookahead ? 1 : 0;
    slot->leveller_amount = leveller_config.amount;
    slot->leveller_max_gain_db = leveller_config.max_gain_db;
    slot->leveller_gate_threshold_db = leveller_config.gate_threshold_db;

    // Per-channel preamp + Master volume (V12)
    for (int i = 0; i < NUM_INPUT_CHANNELS; i++)
        slot->preamp_db_per_ch[i] = global_preamp_db[i];
    slot->master_volume_db = master_volume_db;

    // Input source (V13)
    slot->input_source = active_input_source;

    // Compute CRC over the data section (everything after the 12-byte header)
    const uint8_t *data_start = (const uint8_t *)&slot->filter_recipes;
    size_t data_len = sizeof(PresetSlot) - offsetof(PresetSlot, filter_recipes);
    slot->crc32 = crc32(data_start, data_len);
}

// Apply a dB value to the live master volume globals.  NaN/Inf falls back
// to unity so a stale/garbage slot field can't silently mute the device.
// Delegates to update_master_volume() (in usb_audio.c) for the actual
// clamp + globals update + host notification, keeping a single canonical
// path for any master-volume change.
static void apply_master_volume_db(float db) {
    if (!isfinite(db)) db = MASTER_VOL_MAX_DB;
    update_master_volume(db);
}

// Decide which dB value to apply to master volume based on current mode.
//   mode 0 (independent): use dir_cache.master_volume_db, which was set
//     either by a prior REQ_SAVE_MASTER_VOLUME or by fresh-directory init.
//   mode 1 (per-preset):  use slot->master_volume_db if available (V12+).
//     Falls back to the directory value for older slots so we never leave
//     the live globals at a stale value from a previous load.
// `slot_or_null` may be NULL (e.g. factory-defaults path with no slot).
static void apply_master_volume_from_mode(const PresetSlot *slot_or_null) {
    float db;
    if (dir_cache.master_volume_mode == MASTER_VOLUME_MODE_WITH_PRESET
        && slot_or_null && slot_or_null->version >= 12) {
        db = slot_or_null->master_volume_db;
    } else {
        db = dir_cache.master_volume_db;
    }
    apply_master_volume_db(db);
}

// Apply a validated PresetSlot to the live DSP state.
// `include_pins` controls whether pin config is restored.
// Master volume is *not* touched here — callers invoke
// apply_master_volume_from_mode() separately after this returns, so mode
// changes don't require a preset reload to take effect.
// Does NOT trigger filter recalculation — caller must do that.
static void apply_slot_to_live(const PresetSlot *slot, bool include_pins) {
    // EQ
    memcpy((void *)filter_recipes, slot->filter_recipes, sizeof(filter_recipes));
    // Normalize the per-band bypass byte at the boundary.  Legacy presets
    // saved before this field existed stored 0 in that slot (the old
    // EqParamPacket.reserved); pre-existing 0 → not bypassed → safe.  The
    // explicit normalization defends against garbage from any future code
    // path or corrupted flash.  See Documentation/Features/band_bypass_spec.md.
    // Also normalize .channel/.band.  Presets saved before the
    // dsp_init_default_filters() channel/band fix (or by any path that
    // didn't fully populate the recipe) may have these at zero, which would
    // cause REQ_SET_BAND_BYPASS to misroute writes to slot (0,0).
    for (int ch = 0; ch < NUM_CHANNELS; ch++) {
        for (int b = 0; b < MAX_BANDS; b++) {
            filter_recipes[ch][b].bypass = (filter_recipes[ch][b].bypass == 1) ? 1 : 0;
            filter_recipes[ch][b].channel = ch;
            filter_recipes[ch][b].band = b;
        }
    }

    // Preamp — V12+ has per-channel values, older versions use single legacy field
    if (slot->version >= 12) {
        for (int i = 0; i < NUM_INPUT_CHANNELS; i++) {
            global_preamp_db[i] = slot->preamp_db_per_ch[i];
            float linear = db_to_linear(slot->preamp_db_per_ch[i]);
            global_preamp_mul[i] = (int32_t)(linear * (float)(1 << 28));
            global_preamp_linear[i] = linear;
        }
    } else {
        // Legacy: apply single preamp_db to all channels
        for (int i = 0; i < NUM_INPUT_CHANNELS; i++) {
            global_preamp_db[i] = slot->preamp_db;
            float linear = db_to_linear(slot->preamp_db);
            global_preamp_mul[i] = (int32_t)(linear * (float)(1 << 28));
            global_preamp_linear[i] = linear;
        }
    }

    // Master volume is applied separately by callers via
    // apply_master_volume_from_mode() so a mode change takes effect without
    // a preset reload.
    // Bypass
    bypass_master_eq = (slot->bypass != 0);

