WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
    // Delays
    memcpy((void *)channel_delays_ms, slot->delays_ms, sizeof(channel_delays_ms));

    // Legacy per-channel gain/mute
    for (int i = 0; i < 3; i++) {
        channel_gain_db[i] = slot->channel_gain_db[i];
        float g = db_to_linear(slot->channel_gain_db[i]);
        channel_gain_mul[i] = (int32_t)(g * 32768.0f);
        channel_mute[i] = (slot->channel_mute[i] != 0);
    }

    // Loudness
    loudness_enabled = (slot->loudness_enabled != 0);
    loudness_ref_spl = slot->loudness_ref_spl;
    loudness_intensity_pct = slot->loudness_intensity_pct;
    loudness_recompute_pending = true;

    // Crossfeed
    crossfeed_config.enabled = (slot->crossfeed_enabled != 0);
    crossfeed_config.preset = slot->crossfeed_preset;
    crossfeed_config.itd_enabled = (slot->crossfeed_itd_enabled != 0);
    crossfeed_config.custom_fc = slot->crossfeed_custom_fc;
    crossfeed_config.custom_feed_db = slot->crossfeed_custom_feed_db;
    crossfeed_update_pending = true;

    // Matrix mixer
    for (int in = 0; in < NUM_INPUT_CHANNELS; in++) {
        for (int out = 0; out < NUM_OUTPUT_CHANNELS; out++) {
            matrix_mixer.crosspoints[in][out].enabled = slot->matrix_crosspoints[in][out].enabled;
            matrix_mixer.crosspoints[in][out].phase_invert = slot->matrix_crosspoints[in][out].phase_invert;
            matrix_mixer.crosspoints[in][out].gain_db = slot->matrix_crosspoints[in][out].gain_db;
            matrix_mixer.crosspoints[in][out].gain_linear = db_to_linear(slot->matrix_crosspoints[in][out].gain_db);
        }
    }
    for (int out = 0; out < NUM_OUTPUT_CHANNELS; out++) {
        matrix_mixer.outputs[out].enabled = slot->matrix_outputs[out].enabled;
        matrix_mixer.outputs[out].mute = slot->matrix_outputs[out].mute;
        matrix_mixer.outputs[out].gain_db = slot->matrix_outputs[out].gain_db;
        matrix_mixer.outputs[out].gain_linear = db_to_linear(slot->matrix_outputs[out].gain_db);
        matrix_mixer.outputs[out].delay_ms = slot->matrix_outputs[out].delay_ms;
        channel_delays_ms[CH_OUT_1 + out] = slot->matrix_outputs[out].delay_ms;
    }

    // Pin configuration (conditional)
    if (include_pins) {
#if PICO_RP2350 || defined(STM32H723xx)
        static const uint8_t default_pins[NUM_PIN_OUTPUTS] = {
            PICO_AUDIO_SPDIF_PIN, PICO_SPDIF_PIN_2,
            PICO_SPDIF_PIN_3, PICO_SPDIF_PIN_4, PICO_PDM_PIN
        };
#else
        static const uint8_t default_pins[NUM_PIN_OUTPUTS] = {
            PICO_AUDIO_SPDIF_PIN, PICO_SPDIF_PIN_2, PICO_PDM_PIN
        };
#endif
        for (int i = 0; i < NUM_PIN_OUTPUTS; i++) {
            uint8_t pin = slot->output_pins[i];
            bool valid = (pin <= 29) && (pin != 12) && !(pin >= 23 && pin <= 25);
#if !PICO_RP2350
            if (pin > 28) valid = false;
#endif
            output_pins[i] = valid ? pin : default_pins[i];
        }

        // SPDIF RX pin (lives in the formerly-padding byte after V13's
        // input_source field; see PresetSlot struct comment).  Validate
        // with the same rule as output_pins; if invalid, leave the live
        // value alone — pre-V13-with-rx-pin slots have 0 here, which
        // fails validity, so the live boot-bootstrapped value (or current
        // value) is preserved.  If valid AND it changed AND SPDIF input
        // is currently active, schedule the hot-swap so the running RX
        // library picks up the new GPIO.
        {
            uint8_t pin = slot->spdif_rx_pin;
            bool valid = (pin > 0) && (pin <= 29) && (pin != 12) &&
                         !(pin >= 23 && pin <= 25);
#if !PICO_RP2350
            if (pin > 28) valid = false;
#endif
            if (valid && pin != spdif_rx_pin) {
                spdif_rx_pin = pin;
                if (active_input_source == INPUT_SOURCE_SPDIF) {
                    extern volatile bool spdif_rx_pin_change_pending;
                    spdif_rx_pin_change_pending = true;
                }
            }
        }
    }

    // Channel names (V8+).  Pre-V8 slots predate output_types (V9+) and
    // input_source (V13+) too, so fall back to firmware boot defaults
    // (INPUT_SOURCE_USB, all-SPDIF outputs via NULL output_types).
    if (slot->version >= 8) {
        memcpy(channel_names, slot->channel_names, sizeof(channel_names));
    } else {
        for (int ch = 0; ch < NUM_CHANNELS; ch++)
            get_default_channel_name(ch, INPUT_SOURCE_USB, NULL, channel_names[ch]);
    }

    // I2S configuration (V9+)
    {
        extern uint8_t output_types[];
        extern uint8_t i2s_bck_pin;
        extern uint8_t i2s_mck_pin;
        extern bool    i2s_mck_enabled;
        extern uint16_t i2s_mck_multiplier;
        if (slot->version >= 9) {
            memcpy(output_types, slot->output_types, NUM_SPDIF_INSTANCES);
            i2s_bck_pin = slot->i2s_bck_pin;
            i2s_mck_pin = slot->i2s_mck_pin;
            i2s_mck_enabled = (slot->i2s_mck_enabled != 0);
            if (slot->version >= 11) {
                // V11+: 0=128x, 1=256x
                i2s_mck_multiplier = (slot->i2s_mck_multiplier == 1) ? 256 : 128;
            } else {
                // V9-V10: raw value stored (128 or 0 for 256)
                i2s_mck_multiplier = (slot->i2s_mck_multiplier == 0) ? 256 : slot->i2s_mck_multiplier;
            }
        } else {
            // Default: all S/PDIF, no I2S/MCK
            memset(output_types, 0, NUM_SPDIF_INSTANCES);
            i2s_bck_pin = PICO_I2S_BCK_PIN;
            i2s_mck_pin = PICO_I2S_MCK_PIN;
            i2s_mck_enabled = false;
            i2s_mck_multiplier = 128;
        }
    }

    // Volume Leveller (V10+)
    if (slot->version >= 10) {
        leveller_config.enabled = (slot->leveller_enabled != 0);
        leveller_config.speed = slot->leveller_speed;
        leveller_config.lookahead = (slot->leveller_lookahead != 0);
        leveller_config.amount = slot->leveller_amount;
        leveller_config.max_gain_db = slot->leveller_max_gain_db;
        leveller_config.gate_threshold_db = slot->leveller_gate_threshold_db;
    } else {
        leveller_config.enabled = LEVELLER_DEFAULT_ENABLED;
        leveller_config.amount = LEVELLER_DEFAULT_AMOUNT;
        leveller_config.speed = LEVELLER_DEFAULT_SPEED;
        leveller_config.max_gain_db = LEVELLER_DEFAULT_MAX_GAIN_DB;
        leveller_config.lookahead = LEVELLER_DEFAULT_LOOKAHEAD;
        leveller_config.gate_threshold_db = LEVELLER_DEFAULT_GATE_DB;
    }
    leveller_update_pending = true;
    leveller_reset_pending = true;

