WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
    // Input source (V13+)
    if (slot->version >= 13) {
        uint8_t src = slot->input_source;
        if (input_source_valid(src) && src != active_input_source) {
            pending_input_source = src;
            __dmb();
            input_source_change_pending = true;
        }
    }
    // V12 and earlier: leave input source at current value (USB by default)
}

// ============================================================================
// SLOT VALIDATION
// ============================================================================

// Read and validate a preset slot from flash.
// Returns a pointer to the flash-mapped slot if valid, NULL otherwise.
static const PresetSlot *validate_slot(uint8_t slot) {
    const PresetSlot *s = SLOT_ADDR(slot);
    if (s->magic != SLOT_MAGIC) return NULL;
    if (s->slot_index != slot) return NULL;
    // CRC check
    const uint8_t *data_start = (const uint8_t *)&s->filter_recipes;
    size_t data_len = sizeof(PresetSlot) - offsetof(PresetSlot, filter_recipes);
    if (crc32(data_start, data_len) != s->crc32) return NULL;
    return s;
}

// ============================================================================
// PUBLIC PRESET API
// ============================================================================

uint8_t preset_save(uint8_t slot) {
    if (slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;

    dir_ensure();

    // Build the slot data from current live state
    static PresetSlot slot_buf;
    collect_live_state(&slot_buf, slot);

    // Engage mute before flash writes to prevent audio glitches
    preset_mute_counter = flash_mute_hold_samples();
    preset_loading = true;
    __dmb();

    // Write slot to flash
    if (flash_write_sector(SLOT_SECTOR_OFFSET(slot), &slot_buf, sizeof(slot_buf)) != 0) {
        return PRESET_ERR_FLASH_WRITE;
    }

    // Update directory: mark occupied, set last active
    dir_cache.slot_occupied |= (1u << slot);
    dir_cache.last_active_slot = slot;
    if (dir_flush() != 0) {
        return PRESET_ERR_FLASH_WRITE;
    }

    return PRESET_OK;
}

uint8_t preset_load(uint8_t slot) {
    if (slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;

    dir_ensure();

    // NOTE: muting is now handled by prepare_pipeline_reset() in the main
    // loop caller, which also waits for Core 1 idle before we modify state.

    // Bracket the wholesale state rewrite so per-field param_write calls
    // are suppressed; notify_end_bulk() emits a single BULK_INVALIDATED.
    // PRESET_LOADED is pushed here (ahead of the bulk) so the host sees
    // the two events in order: preset-loaded, then invalidate.
    notify_push_preset_loaded(slot);
    notify_begin_bulk(PARAM_SRC_PRESET);

    if (dir_cache.slot_occupied & (1u << slot)) {
        // Slot has user data — validate and load it
        const PresetSlot *s = validate_slot(slot);
        if (!s) {
            preset_loading = false;
            notify_end_bulk();
            return PRESET_ERR_CRC;
        }
        apply_slot_to_live(s, dir_cache.include_pins != 0);
        apply_master_volume_from_mode(s);
    } else {
        // Slot not configured — apply factory defaults
        apply_factory_defaults();
    }

    // Recalculate filters and delays for the current sample rate
    extern volatile AudioState audio_state;
    float rate = (float)audio_state.freq;
    dsp_recalculate_all_filters(rate);
    dsp_update_delay_samples(rate);

    // Zero all delay line buffers.  Without this, stale audio from the
    // previous preset's delay lines bleeds through — e.g. switching from
    // a 40ms delay to 0ms would replay ~40ms of old audio as the write
    // index wraps past the old data.
    extern
#if PICO_RP2350 || defined(STM32H723xx)
    float delay_lines[NUM_DELAY_CHANNELS][MAX_DELAY_SAMPLES];
#else
    int32_t delay_lines[NUM_DELAY_CHANNELS][MAX_DELAY_SAMPLES];
#endif
    memset(delay_lines, 0, sizeof(delay_lines));

#if !defined(STM32H723xx)
    // Transition Core 1 mode to match the new output enable state
    Core1Mode new_mode = derive_core1_mode();
    if (new_mode != core1_mode) {
        core1_mode = new_mode;
#if ENABLE_SUB
        pdm_set_enabled(new_mode == CORE1_MODE_PDM);
#endif
        __sev();  // Wake Core 1 to pick up mode change
    }
#endif

    // Update directory: set last active
    dir_cache.last_active_slot = slot;
    dir_flush();  // Best-effort; preset is already loaded even if dir write fails

    // Close the bulk bracket; emits one BULK_INVALIDATED with source=PRESET.
    notify_end_bulk();
    return PRESET_OK;
}

uint8_t preset_delete(uint8_t slot) {
    if (slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;

    dir_ensure();

    // NOTE: muting is now handled by prepare_pipeline_reset() in the main
    // loop caller.  The mute counter and preset_loading flag are set there.
    // See flash_write_sector() for why we no longer drain SPDIF RX FIFO
    // here (was causing preset_save/delete crashes via Core 1 dispatch
    // inside the flash blackout prep).
    __dmb();

    // Erase the slot's flash sector (same lockout guard as flash_write_sector)
    bool do_lockout = multicore_lockout_victim_is_initialized(1)
                      && (__get_current_exception() == 0);
    if (do_lockout) multicore_lockout_start_blocking();

    uint32_t flags = save_and_disable_interrupts();
    dspi_flash_range_erase(SLOT_SECTOR_OFFSET(slot), FLASH_SECTOR_SIZE);
    restore_interrupts(flags);

    if (do_lockout) multicore_lockout_end_blocking();

    // Re-seed feedback controller after interrupt blackout
    fb_ctrl_reset(&fb_ctrl, nominal_feedback_10_14 << 2);
    feedback_10_14 = nominal_feedback_10_14;
    preset_mute_counter = flash_mute_hold_samples();
    preset_loading = true;

    // Update directory — clear occupied bit and name, keep slot selected if active
    dir_cache.slot_occupied &= ~(1u << slot);
    memset(dir_cache.slot_names[slot], 0, PRESET_NAME_LEN);
    dir_flush();

    // If deleting the active slot, apply factory defaults to live state
    if (slot == dir_cache.last_active_slot) {
        preset_mute_counter = PRESET_MUTE_SAMPLES;
        preset_loading = true;
        __dmb();

        apply_factory_defaults();

        extern volatile AudioState audio_state;
        float rate = (float)audio_state.freq;
        dsp_recalculate_all_filters(rate);
        dsp_update_delay_samples(rate);

        // Transition Core 1 mode (factory defaults disable outputs 2+)
        Core1Mode new_mode = derive_core1_mode();
        if (new_mode != core1_mode) {
            core1_mode = new_mode;
#if ENABLE_SUB
            pdm_set_enabled(new_mode == CORE1_MODE_PDM);
#endif
            __sev();
        }
    }

    return PRESET_OK;
}

uint8_t preset_get_name(uint8_t slot, char *name_out) {
    if (slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;
    dir_ensure();
    memcpy(name_out, dir_cache.slot_names[slot], PRESET_NAME_LEN);
    return PRESET_OK;
}

uint8_t preset_set_name(uint8_t slot, const char *name) {
    if (slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;
    dir_ensure();

