WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
    // Copy name with guaranteed NUL termination
    memset(dir_cache.slot_names[slot], 0, PRESET_NAME_LEN);
    strncpy(dir_cache.slot_names[slot], name, PRESET_NAME_LEN - 1);

    if (dir_flush() != 0) {
        return PRESET_ERR_FLASH_WRITE;
    }
    return PRESET_OK;
}

void preset_get_directory(uint16_t *slot_occupied, uint8_t *startup_mode,
                          uint8_t *default_slot, uint8_t *last_active,
                          uint8_t *include_pins, uint8_t *master_volume_mode) {
    dir_ensure();
    *slot_occupied      = dir_cache.slot_occupied;
    *startup_mode       = dir_cache.startup_mode;
    *default_slot       = dir_cache.default_slot;
    *last_active        = dir_cache.last_active_slot;
    *include_pins       = dir_cache.include_pins;
    *master_volume_mode = dir_cache.master_volume_mode;
}

uint8_t preset_set_startup(uint8_t mode, uint8_t default_slot) {
    if (mode > PRESET_STARTUP_LAST_ACTIVE) return PRESET_ERR_INVALID_SLOT;
    if (default_slot >= PRESET_SLOTS) return PRESET_ERR_INVALID_SLOT;
    dir_ensure();

    dir_cache.startup_mode = mode;
    dir_cache.default_slot = default_slot;
    if (dir_flush() != 0) {
        return PRESET_ERR_FLASH_WRITE;
    }
    return PRESET_OK;
}

void preset_set_include_pins(uint8_t include) {
    dir_ensure();
    dir_cache.include_pins = include ? 1 : 0;
    dir_flush();
}

void preset_set_master_volume_mode(uint8_t mode) {
    if (mode > MASTER_VOLUME_MODE_WITH_PRESET) mode = MASTER_VOLUME_MODE_INDEPENDENT;
    dir_ensure();
    dir_cache.master_volume_mode = mode;
    dir_flush();
}

// Copy the live master volume into the directory's independent field and
// persist.  Accepted in both modes — in mode 1 the value is dormant until
// the user switches to mode 0.  Matches the deferred-flush machinery used
// for the other directory-writing setters.
uint8_t preset_save_master_volume(void) {
    dir_ensure();
    dir_cache.master_volume_db = master_volume_db;
    if (dir_flush() != 0) return PRESET_ERR_FLASH_WRITE;
    return PRESET_OK;
}

// Read back the directory's independent master volume field (the value that
// would apply at boot in mode 0).  Does not touch live globals.
float preset_get_saved_master_volume(void) {
    dir_ensure();
    return dir_cache.master_volume_db;
}

uint8_t preset_get_active(void) {
    dir_ensure();
    return dir_cache.last_active_slot;
}

// ============================================================================
// BOOT / MIGRATION
// ============================================================================

// Attempt to migrate legacy single-sector data (pre-preset firmware) into
// preset slot 0.  Called when no preset directory exists on flash.
static bool migrate_legacy(void) {
    const LegacyFlashStorage *legacy = LEGACY_ADDR;
    if (legacy->magic != LEGACY_MAGIC) return false;

    // Verify legacy CRC
    const uint8_t *data_start = (const uint8_t *)&legacy->filter_recipes;
    size_t data_len = sizeof(LegacyFlashStorage) - offsetof(LegacyFlashStorage, filter_recipes);
    if (crc32(data_start, data_len) != legacy->crc32) return false;

    // Build a PresetSlot from the legacy data.
    // The data section layout is identical, so we can memcpy the data portion.
    static PresetSlot slot_buf;
    memset(&slot_buf, 0, sizeof(slot_buf));
    slot_buf.magic = SLOT_MAGIC;
    slot_buf.version = legacy->version;
    slot_buf.slot_index = 0;

    // Copy data fields (identical layout from filter_recipes onward)
    memcpy(&slot_buf.filter_recipes, &legacy->filter_recipes,
           sizeof(LegacyFlashStorage) - offsetof(LegacyFlashStorage, filter_recipes));

    // Recompute CRC for the slot format
    const uint8_t *slot_data = (const uint8_t *)&slot_buf.filter_recipes;
    size_t slot_data_len = sizeof(PresetSlot) - offsetof(PresetSlot, filter_recipes);
    slot_buf.crc32 = crc32(slot_data, slot_data_len);

    // Write slot 0
    if (flash_write_sector(SLOT_SECTOR_OFFSET(0), &slot_buf, sizeof(slot_buf)) != 0) {
        return false;
    }

    // Create a fresh directory with slot 0 occupied and set as default
    memset(&dir_cache, 0, sizeof(dir_cache));
    dir_cache.startup_mode = PRESET_STARTUP_SPECIFIED;
    dir_cache.default_slot = 0;
    dir_cache.last_active_slot = 0;
    dir_cache.include_pins = 1;
    dir_cache.master_volume_mode = MASTER_VOLUME_MODE_INDEPENDENT;
    dir_cache.master_volume_db   = MASTER_VOL_DEFAULT_DB;
    dir_cache.spdif_rx_pin = PICO_SPDIF_RX_PIN_DEFAULT;
    dir_cache.slot_occupied = 0x0001;  // Slot 0 occupied
    strncpy(dir_cache.slot_names[0], "Migrated", PRESET_NAME_LEN - 1);
    dir_cache_valid = true;

    if (dir_flush() != 0) {
        return false;
    }

    return true;
}

int preset_boot_load(void) {
    // Try to load the preset directory from flash
    if (dir_load_cache()) {
        // Restore device-level SPDIF RX pin from directory
        uint8_t rx_pin = dir_cache.spdif_rx_pin;
        if (rx_pin > 0 && rx_pin <= 29 && rx_pin != 12 &&
            !(rx_pin >= 23 && rx_pin <= 25)) {
            spdif_rx_pin = rx_pin;
        } else {
            spdif_rx_pin = PICO_SPDIF_RX_PIN_DEFAULT;
        }

        // Directory exists — determine which slot to load
        uint8_t target_slot;

        if (dir_cache.startup_mode == PRESET_STARTUP_LAST_ACTIVE) {
            target_slot = dir_cache.last_active_slot;
        } else {
            // PRESET_STARTUP_SPECIFIED (default)
            target_slot = dir_cache.default_slot;
        }

        // Clamp to valid range
        if (target_slot >= PRESET_SLOTS) {
            target_slot = dir_cache.default_slot;
            if (target_slot >= PRESET_SLOTS) target_slot = 0;
        }

        // Load the slot: user data if occupied, factory defaults if empty
        if ((dir_cache.slot_occupied & (1u << target_slot))) {
            const PresetSlot *s = validate_slot(target_slot);
            if (s) {
                apply_slot_to_live(s, dir_cache.include_pins != 0);
                apply_master_volume_from_mode(s);
            } else {
                // Corrupt data — fall back to factory defaults
                apply_factory_defaults();
            }
        } else {
            apply_factory_defaults();
        }

        dir_cache.last_active_slot = target_slot;
        return FLASH_OK;
    }

    // No directory — try legacy migration
    if (migrate_legacy()) {
        // Migration succeeded; slot 0 is now populated.  Load it.
        const PresetSlot *s = validate_slot(0);
        if (s) {
            apply_slot_to_live(s, false);  // Legacy migration: don't override pins
            apply_master_volume_from_mode(s);
        } else {
            apply_factory_defaults();
        }
        return FLASH_OK;
    }

    // First boot, no legacy data — initialize directory and use slot 0
    dir_ensure();
    dir_flush();
    apply_factory_defaults();
    return FLASH_OK;
}

// ============================================================================
// LEGACY API (redirects through preset system)
// ============================================================================

int flash_save_params(void) {
    dir_ensure();

    // Determine which slot to save into
    uint8_t slot = dir_cache.last_active_slot;
    if (slot >= PRESET_SLOTS) {
        // No active slot — use slot 0
        slot = 0;
    }

    uint8_t result = preset_save(slot);
    switch (result) {
        case PRESET_OK:             return FLASH_OK;
        case PRESET_ERR_FLASH_WRITE: return FLASH_ERR_WRITE;
        default:                    return FLASH_ERR_WRITE;
    }
}

int flash_load_params(void) {
    dir_ensure();

    uint8_t slot = dir_cache.last_active_slot;
    if (slot >= PRESET_SLOTS) {
        slot = 0;
    }

    uint8_t result = preset_load(slot);
    switch (result) {
        case PRESET_OK:            return FLASH_OK;
        case PRESET_ERR_CRC:       return FLASH_ERR_CRC;
        default:                   return FLASH_ERR_WRITE;
    }
}

// Reset the live DSP state to factory defaults.
// Does NOT modify the directory or active slot tracking.
static void apply_factory_defaults(void) {
    dsp_init_default_filters();

    // Preamp — reset all input channels to unity
    for (int i = 0; i < NUM_INPUT_CHANNELS; i++) {
        global_preamp_db[i]      = 0.0f;
        global_preamp_mul[i]     = (1 << 28);
        global_preamp_linear[i]  = 1.0f;
    }

