WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/flash_storage.c
    // Master volume — defer to the mode-aware helper so mode 0 restores the
    // directory's independent value instead of always stomping to unity.
    // (Mode 1 with slot_or_null=NULL also falls back to the directory value.)
    // Notifications are emitted via update_master_volume() inside
    // apply_master_volume_db().
    apply_master_volume_from_mode(NULL);

    // Bypass
    bypass_master_eq = false;

    // Per-channel gain and mute
    for (int i = 0; i < 3; i++) {
        channel_gain_db[i] = 0.0f;
        channel_gain_mul[i] = 32768;
        channel_mute[i] = false;
    }

    // Loudness
    loudness_enabled = false;
    loudness_ref_spl = 87.0f;
    loudness_intensity_pct = 100.0f;
    loudness_recompute_pending = true;

    // Crossfeed
    crossfeed_config.enabled = false;
    crossfeed_config.itd_enabled = true;
    crossfeed_config.preset = CROSSFEED_PRESET_DEFAULT;
    crossfeed_config.custom_fc = 700.0f;
    crossfeed_config.custom_feed_db = 4.5f;
    crossfeed_update_pending = true;

    // Matrix mixer: stereo pass-through on first pair
    memset(&matrix_mixer, 0, sizeof(matrix_mixer));
    matrix_mixer.crosspoints[0][0].enabled = 1;
    matrix_mixer.crosspoints[0][0].gain_db = 0.0f;
    matrix_mixer.crosspoints[0][0].gain_linear = 1.0f;
    matrix_mixer.crosspoints[1][1].enabled = 1;
    matrix_mixer.crosspoints[1][1].gain_db = 0.0f;
    matrix_mixer.crosspoints[1][1].gain_linear = 1.0f;
    matrix_mixer.outputs[0].enabled = 1;
    matrix_mixer.outputs[0].gain_linear = 1.0f;
    matrix_mixer.outputs[1].enabled = 1;
    matrix_mixer.outputs[1].gain_linear = 1.0f;
    for (int out = 2; out < NUM_OUTPUT_CHANNELS; out++) {
        matrix_mixer.outputs[out].enabled = 0;
        matrix_mixer.outputs[out].gain_linear = 1.0f;
    }

    // Reset pin configuration
    output_pins[0] = PICO_AUDIO_SPDIF_PIN;
    output_pins[1] = PICO_SPDIF_PIN_2;
#if PICO_RP2350 || defined(STM32H723xx)
    output_pins[2] = PICO_SPDIF_PIN_3;
    output_pins[3] = PICO_SPDIF_PIN_4;
    output_pins[4] = PICO_PDM_PIN;
#else
    output_pins[2] = PICO_PDM_PIN;
#endif

    // Reset channel names to factory defaults (USB input, all-SPDIF outputs).
    // active_input_source and output_types are reset to those values below;
    // pass NULL for output_types so the function uses its all-SPDIF fallback.
    for (int ch = 0; ch < NUM_CHANNELS; ch++)
        get_default_channel_name(ch, INPUT_SOURCE_USB, NULL, channel_names[ch]);

    // Reset I2S configuration
    {
        extern uint8_t output_types[];
        extern uint8_t i2s_bck_pin;
        extern uint8_t i2s_mck_pin;
        extern bool    i2s_mck_enabled;
        extern uint16_t i2s_mck_multiplier;
        memset(output_types, 0, NUM_SPDIF_INSTANCES);  // All S/PDIF
        i2s_bck_pin = PICO_I2S_BCK_PIN;
        i2s_mck_pin = PICO_I2S_MCK_PIN;
        i2s_mck_enabled = false;
        i2s_mck_multiplier = 128;
    }

    // Volume Leveller
    leveller_config.enabled = LEVELLER_DEFAULT_ENABLED;
    leveller_config.amount = LEVELLER_DEFAULT_AMOUNT;
    leveller_config.speed = LEVELLER_DEFAULT_SPEED;
    leveller_config.max_gain_db = LEVELLER_DEFAULT_MAX_GAIN_DB;
    leveller_config.lookahead = LEVELLER_DEFAULT_LOOKAHEAD;
    leveller_config.gate_threshold_db = LEVELLER_DEFAULT_GATE_DB;
    leveller_update_pending = true;
    leveller_reset_pending = true;

    // Input source: default to USB
    active_input_source = INPUT_SOURCE_USB;
}

void flash_factory_reset(void) {
    // Bracket so per-field writes in apply_factory_defaults() are suppressed
    // and the host sees exactly one BULK_INVALIDATED(source=FACTORY).
    notify_begin_bulk(PARAM_SRC_FACTORY);
    apply_factory_defaults();
    notify_end_bulk();
}
